{
    "stoi": {
        "\n": 0,
        " ": 1,
        "!": 2,
        "\"": 3,
        "'": 4,
        "(": 5,
        ")": 6,
        ",": 7,
        "-": 8,
        ".": 9,
        ":": 10,
        ";": 11,
        "?": 12,
        "A": 13,
        "D": 14,
        "E": 15,
        "F": 16,
        "G": 17,
        "H": 18,
        "I": 19,
        "K": 20,
        "L": 21,
        "M": 22,
        "N": 23,
        "O": 24,
        "P": 25,
        "R": 26,
        "S": 27,
        "T": 28,
        "W": 29,
        "Y": 30,
        "Z": 31,
        "a": 32,
        "b": 33,
        "c": 34,
        "d": 35,
        "e": 36,
        "f": 37,
        "g": 38,
        "h": 39,
        "i": 40,
        "j": 41,
        "k": 42,
        "l": 43,
        "m": 44,
        "n": 45,
        "o": 46,
        "p": 47,
        "q": 48,
        "r": 49,
        "s": 50,
        "t": 51,
        "u": 52,
        "v": 53,
        "w": 54,
        "x": 55,
        "y": 56,
        "z": 57,
        "—": 58
    },
    "itos": {
        "0": "\n",
        "1": " ",
        "2": "!",
        "3": "\"",
        "4": "'",
        "5": "(",
        "6": ")",
        "7": ",",
        "8": "-",
        "9": ".",
        "10": ":",
        "11": ";",
        "12": "?",
        "13": "A",
        "14": "D",
        "15": "E",
        "16": "F",
        "17": "G",
        "18": "H",
        "19": "I",
        "20": "K",
        "21": "L",
        "22": "M",
        "23": "N",
        "24": "O",
        "25": "P",
        "26": "R",
        "27": "S",
        "28": "T",
        "29": "W",
        "30": "Y",
        "31": "Z",
        "32": "a",
        "33": "b",
        "34": "c",
        "35": "d",
        "36": "e",
        "37": "f",
        "38": "g",
        "39": "h",
        "40": "i",
        "41": "j",
        "42": "k",
        "43": "l",
        "44": "m",
        "45": "n",
        "46": "o",
        "47": "p",
        "48": "q",
        "49": "r",
        "50": "s",
        "51": "t",
        "52": "u",
        "53": "v",
        "54": "w",
        "55": "x",
        "56": "y",
        "57": "z",
        "58": "—"
    }
}